In [7]:
import numpy as np

In [8]:
import pandas as pd

# Series In Pandas

In [9]:
labels = ["a","b","c"]
arr_list = [100,200,300]
num_arry = np.array(arr_list)
data = {"a":100,"b":200,"c":"300"}

In [10]:
pd.Series(arr_list)

0    100
1    200
2    300
dtype: int64

In [11]:
pd.Series(num_arry)

0    100
1    200
2    300
dtype: int64

In [12]:
series_one = pd.Series(arr_list,labels)

In [13]:
series_one["a"]

100

In [14]:
pd.Series(data)

a    100
b    200
c    300
dtype: object

In [15]:
ser_one = pd.Series(data)
ser_two = pd.Series(data)

In [16]:
ser_one

a    100
b    200
c    300
dtype: object

In [17]:
ser_three =pd.Series(arr_list,index=np.arange(4,7))

In [18]:
ser_three

4    100
5    200
6    300
dtype: int64

In [19]:
ser_one + ser_three

a    NaN
b    NaN
c    NaN
4    NaN
5    NaN
6    NaN
dtype: object

# Pandas- DataFrames

In [20]:
from numpy import random

In [21]:
data = random.randn(3,4) + 5

In [22]:
pd.DataFrame(data)

          0         1         2         3
0  6.024804  6.094901  3.923676  4.766595
1  3.824531  6.418699  2.909295  4.798371
2  3.787232  5.792914  5.609345  5.538634

In [28]:
index= "A B C".split(' ')
colums = "W X Y Z".split()

In [30]:
dataframe = pd.DataFrame(data,index=index,columns=colums)

In [33]:
dataframe["X"]

A    6.094901
B    6.418699
C    5.792914
Name: X, dtype: float64

In [34]:
dataframe

          W         X         Y         Z
A  6.024804  6.094901  3.923676  4.766595
B  3.824531  6.418699  2.909295  4.798371
C  3.787232  5.792914  5.609345  5.538634

In [37]:
dataframe["W"]

A    6.024804
B    3.824531
C    3.787232
Name: W, dtype: float64

In [42]:
dataframe[["W","X"]]

          W         X
A  6.024804  6.094901
B  3.824531  6.418699
C  3.787232  5.792914

In [43]:
dataframe

          W         X         Y         Z
A  6.024804  6.094901  3.923676  4.766595
B  3.824531  6.418699  2.909295  4.798371
C  3.787232  5.792914  5.609345  5.538634

In [45]:
dataframe["Sum"]=dataframe["W"]+dataframe["Y"]

In [48]:
dataframe["Sum"]

26.07888386718598

In [49]:
np.sum(dataframe["Sum"])

26.07888386718598

In [51]:
type(dataframe["W"])

pandas.core.series.Series

In [60]:
sr = pd.Series(np.arange(0,3),dataframe.index)

In [63]:
dataframe["new"] = sr

In [64]:
dataframe

          W         X         Y         Z       Sum  new
A  6.024804  6.094901  3.923676  4.766595  9.948480    0
B  3.824531  6.418699  2.909295  4.798371  6.733827    1
C  3.787232  5.792914  5.609345  5.538634  9.396577    2

In [70]:
dataframe.drop("A")

          W         X         Y         Z       Sum  new
B  3.824531  6.418699  2.909295  4.798371  6.733827    1
C  3.787232  5.792914  5.609345  5.538634  9.396577    2

In [74]:
dataframe.drop("W",axis=1)

          X         Y         Z       Sum  new
A  6.094901  3.923676  4.766595  9.948480    0
B  6.418699  2.909295  4.798371  6.733827    1
C  5.792914  5.609345  5.538634  9.396577    2

In [75]:
dataframe

          W         X         Y         Z       Sum  new
A  6.024804  6.094901  3.923676  4.766595  9.948480    0
B  3.824531  6.418699  2.909295  4.798371  6.733827    1
C  3.787232  5.792914  5.609345  5.538634  9.396577    2

### Working With Rows

In [77]:
dataframe

          W         X         Y         Z       Sum  new
A  6.024804  6.094901  3.923676  4.766595  9.948480    0
B  3.824531  6.418699  2.909295  4.798371  6.733827    1
C  3.787232  5.792914  5.609345  5.538634  9.396577    2

In [81]:
dataframe.loc[["A","B"]]

          W         X         Y         Z       Sum  new
A  6.024804  6.094901  3.923676  4.766595  9.948480    0
B  3.824531  6.418699  2.909295  4.798371  6.733827    1

In [91]:
dataframe.loc["D"] = dataframe.sum(axis=0)

In [99]:
dataframe.drop("D",axis=1,inplace=True)

In [100]:
dataframe

           W          X          Y          Z        Sum  new
A   6.024804   6.094901   3.923676   4.766595   9.948480  0.0
B   3.824531   6.418699   2.909295   4.798371   6.733827  1.0
C   3.787232   5.792914   5.609345   5.538634   9.396577  2.0
D  13.636567  18.306514  12.442317  15.103600  26.078884  3.0

In [103]:
dataframe.loc['A']

W      6.024804
X      6.094901
Y      3.923676
Z      4.766595
Sum    9.948480
new    0.000000
Name: A, dtype: float64

In [104]:
# selection of the sub row from the dataframe

In [117]:
dataframe.loc[["A","B"],["W","X"]]

          W         X
A  6.024804  6.094901
B  3.824531  6.418699

In [118]:
dataframe.iloc[0]

W      6.024804
X      6.094901
Y      3.923676
Z      4.766595
Sum    9.948480
new    0.000000
Name: A, dtype: float64

In [124]:
# how to create dataframe in pandas 
df = pd.DataFrame({
    "name":["cat","dog"],
    "age":[1,2]     
})

In [129]:
type(df["name"])

pandas.core.series.Series

In [130]:
# the type of dataframe is series

In [131]:
df.iloc[0]

name    cat
age       1
Name: 0, dtype: object

In [135]:
dataframe.describe().count()

W      8
X      8
Y      8
Z      8
Sum    8
new    8
dtype: int64

In [145]:
dataframe["W"].shape

(4,)

In [146]:
dataframe

           W          X          Y          Z        Sum  new
A   6.024804   6.094901   3.923676   4.766595   9.948480  0.0
B   3.824531   6.418699   2.909295   4.798371   6.733827  1.0
C   3.787232   5.792914   5.609345   5.538634   9.396577  2.0
D  13.636567  18.306514  12.442317  15.103600  26.078884  3.0

In [156]:
dataframe.loc["A":"C":,"W":"Y"]

          W         X         Y
A  6.024804  6.094901  3.923676
B  3.824531  6.418699  2.909295
C  3.787232  5.792914  5.609345

In [159]:
array_one  = np.arange(0,10)

In [163]:
my_list = [1,2,45,6,6]

In [165]:
my_list_two = np.array(my_list)

In [167]:
my_list_two[my_list_two >4]

array([45,  6,  6])